
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.fee_pay_team_telephony_subscription
  * azurerm_api_management_subscription.pcipal_supplier_subscription
  * module.payment-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_telephony_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_telephony_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/5a89d26c-6d91-4997-8a4e-13e4e279ee0a"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.pcipal_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "pcipal_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/ea576e34-00bd-4eff-80d5-85f6c6392bb2"
        # (10 unchanged attributes hidden)
    }

  # module.payment-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
        id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/payment-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/payment-postgres-db-v15-aat/configurations/azure.extensions"
        name      = "azure.extensions"
      ~ value     = "pg_stat_statements,pg_buffercache,hypopg" -> "plpgsql,pg_stat_statements,pg_buffercache,hypopg"
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/payment-postgres-db-v15-aat-read-user-name/79c17a8d781a4426ab74f8280602adee" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-aat-read-user-name"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/payment-postgres-db-v15-aat-read-user-name/versions/79c17a8d781a4426ab74f8280602adee" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/payment-postgres-db-v15-aat-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "79c17a8d781a4426ab74f8280602adee" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/payment-postgres-db-v15-aat-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/payment-postgres-db-v15-aat-read-user-password/6d851a3c3ccd4c21beb07aca9768ad8f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-aat-read-user-password"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/payment-postgres-db-v15-aat-read-user-password/versions/6d851a3c3ccd4c21beb07aca9768ad8f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/payment-postgres-db-v15-aat-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "6d851a3c3ccd4c21beb07aca9768ad8f" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/payment-postgres-db-v15-aat-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1785,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->